{
  "id": "9435f1bf-472d-47c5-a759-99beadd98076",
  "title": "Street Kittens of Istanbul",
  "description": "A learning unit about Street Kittens of Istanbul",
  "learner_level": "intermediate",
  "learning_objectives": [
    {
      "id": "lo_1",
      "title": "Understand Kitten Commons",
      "description": "Explain the managed-commons context for Istanbul's street kittens, distinguishing stray vs. feral statuses, kitten life-stage bands, key actors, and seasonality.",
      "bloom_level": null
    },
    {
      "id": "lo_2",
      "title": "Map Urban Microhabitats",
      "description": "Map a 50–100 m urban microhabitat to identify food sources, shelters, risks, and human–cat interfaces, and recommend placements for shelters and trap sites.",
      "bloom_level": null
    },
    {
      "id": "lo_3",
      "title": "Sequence Kitten Triage",
      "description": "Sequence kitten triage in warmth–hydration–respiration–nutrition order and classify cases into urgent, priority, or routine pathways.",
      "bloom_level": null
    },
    {
      "id": "lo_4",
      "title": "Plan Age-Based Care",
      "description": "Specify age-appropriate feeding, micro-shelter features, and a basic vaccination and parasite-control schedule for a given kitten profile.",
      "bloom_level": null
    },
    {
      "id": "lo_5",
      "title": "Design Seasonal TNR",
      "description": "Design a Trap–Neuter–Return (TNR) workflow aligned to seasonality, including ear-tipping, return-to-territory, and simple record-keeping.",
      "bloom_level": null
    },
    {
      "id": "lo_6",
      "title": "Handle Critical Edge Cases",
      "description": "Identify edge cases such as lactating queens, late pregnancy, panleukopenia outbreaks, or seasonal extremes and specify the required operational adjustments.",
      "bloom_level": null
    }
  ],
  "target_lesson_count": 2,
  "source_material": null,
  "generated_from_topic": true,
  "is_global": true,
  "owner_key": "eylem",
  "art_image_description": "Weimar Edge illustration of Street Kittens of Istanbul highlighting Understand Kitten Commons, Map Urban Microhabitats with petrol blue geometry and gilt accents.",
  "lessons": [
    {
      "id": "intro-lesson-kittens-istanbul",
      "title": "Unit Introduction: Street Kittens of Istanbul",
      "learner_level": "intermediate",
      "is_intro": true,
      "podcast_transcript": "Picture Istanbul at dawn. The call to prayer, the hiss of kettles, and in the alley between a bakery and a barber—two wet-nosed kittens blinking into the day. They don't make it because of luck. They make it because a city of humans manages a commons, whether it knows it or not. That's our unit: from seeing the system to working the system.\n\nStart with classification. Strays tolerate us. Ferals don't. That single split decides how close we get, how we feed, how we trap. Then read the clock on a kitten's body. Neonate, zero to two weeks—eyes closed, heat-dependent. Infant, two to four—eyes open, wobble stance. Transitional, four to eight—teething, learning to eat. Juvenile, eight to twenty-four—fast, curious, hitting surgical weight. Seasonality is the drumbeat. Spring and late summer flood the streets with kittens. Winter tests endurance. If you know the rhythm, you can play ahead of it.\n\nNow shrink your world to a 50–100 meter circle. Walk it. Sketch it. Where's food? Dumpsters behind meyhanes, a feeder's mat of bowls under the fig tree, a cafe's crumbs at closing. Where's shelter? The dry corner under the stairs, a basement vent, an old \"cat house\" near the kiosk. Where's danger? A taxi cut-through, a dog pack's patrol, a gutter that becomes a river when it rains, the shop owner who's had enough. Where do cats meet people? Schools, markets, tourist choke points. Name the actors: the auntie who feeds at dusk, the municipal mobile clinic two streets over, the guy who complains when bowls block his door.\n\nThen place things with intention. Micro-shelters elevated, dry, out of the wind, with two exits. Insulate before the cold; shade and water before the heat. Keep feeding stations tidy and consistent, but not on thresholds. And keep trap sites separate and discreet, pre-baited so trap day isn't a surprise. Four to six weeks before the spring and late-summer waves, turn up the trapping. Prioritize juveniles at weight and intact adults. Lactating queens? Sterilize only if you can return same day to the exact spot.\n\nLesson two starts with a single rule: triage in order—warmth, hydration, respiration, nutrition. Cold and limp, or breathing hard? That's urgent. Warm first. Don't feed a cold kitten. Stable but snotty eyes, underweight? Priority. Bright-eyed, eating, normal vitals? Routine.\n\nFeed by stage. Neonates get kitten milk replacer by bottle, small and frequent, in warmth and dryness. Two to four weeks, gruel. Four to eight, move to wet food. Eight and up, high-protein wet and dry. Micro-shelters get straw in winter, not fabric. Airflow and shade in heat. Begin core vaccines around eight to nine weeks; boost three to four weeks later. Deworm by weight. Add flea control to cut vectors and protect the group.\n\nTNR is choreography. Pre-bait. Trap. Sterilize. Ear-tip. Vaccinate when possible. Recover. Return to the same territory within 24–48 hours. Time campaigns for late winter and late summer to blunt kitten surges. Track everything: photos, locations, ear-tip status, sex, dates, interventions. That ledger is your memory.\n\nEdge cases change the tempo. Lactating queens—same-day return. Late pregnancy—postpone if you can. Panleukopenia—stop mixing, isolate, bleach. Heatwave—shade and water stations. Winter—elevate shelters, add straw, cut drafts. And watch the socialization window: from roughly two to seven weeks, gentle daily handling can turn a life on the street into a home.\n\nSo here's your charge. Map one microhabitat. Place one shelter right. Set one clean feeding routine apart from your future trap line. Run one triage. Plan one season-timed TNR cycle, and write it down. Istanbul's street kittens aren't waiting for perfect. They're waiting for you to start. Next, pick a colony and commit twelve weeks. We'll be here, walking the alley with you.",
      "podcast_voice": "Plain",
      "podcast_duration_seconds": 233,
      "objectives": [
        {
          "id": "lo_1",
          "title": "Understand Kitten Commons",
          "description": "Explain the managed-commons context for Istanbul's street kittens, distinguishing stray vs. feral statuses, kitten life-stage bands, key actors, and seasonality.",
          "bloom_level": null
        }
      ],
      "mcqs": [],
      "short_answers": []
    },
    {
      "id": "5866b675-56ec-4731-9fca-36e52cf71e2b",
      "title": "Managed Commons in Practice: Context, Seasonality, and Microhabitats",
      "learner_level": "intermediate",
      "source_material": null,
      "objectives": [
        {
          "id": "lo_1",
          "title": "Understand Kitten Commons",
          "description": "Explain the managed-commons context for Istanbul's street kittens, distinguishing stray vs. feral statuses, kitten life-stage bands, key actors, and seasonality.",
          "bloom_level": null
        },
        {
          "id": "lo_2",
          "title": "Map Urban Microhabitats",
          "description": "Map a 50–100 m urban microhabitat to identify food sources, shelters, risks, and human–cat interfaces, and recommend placements for shelters and trap sites.",
          "bloom_level": null
        }
      ],
      "mcqs": [
        {
          "stem": "Which observation best indicates an outdoor cat is a stray rather than feral?",
          "options": [
            {
              "text": "Approaches within arm's reach for food",
              "rationale_wrong": null
            },
            {
              "text": "Hides whenever people enter the alley",
              "rationale_wrong": "Avoiding humans aligns with feral behavior."
            },
            {
              "text": "Has an ear-tip notch",
              "rationale_wrong": "Ear-tips mark sterilization status, not socialization."
            },
            {
              "text": "Hunts mostly at night",
              "rationale_wrong": "Activity timing does not define socialization."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Understand",
          "difficulty": "Medium",
          "misconceptions": [
            "feral_equals_nocturnal"
          ],
          "correct_rationale": "Strays accept close human proximity while ferals avoid approach."
        },
        {
          "stem": "You find a shivering 1-week-old kitten. What is the first action?",
          "options": [
            {
              "text": "Warm the neonate before attempting to feed",
              "rationale_wrong": null
            },
            {
              "text": "Offer cow's milk immediately",
              "rationale_wrong": "Cow's milk upsets digestion and cold kittens cannot safely feed."
            },
            {
              "text": "Place a trap near the nest",
              "rationale_wrong": "TNR is secondary to stabilizing the neonate."
            },
            {
              "text": "Move the kitten to an outdoor shelter",
              "rationale_wrong": "Passive sheltering delays urgent warming."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Apply",
          "difficulty": "Medium",
          "misconceptions": [
            "feed_cold_kittens"
          ],
          "correct_rationale": "Neonates must be warmed before feeding to avoid aspiration and shock."
        },
        {
          "stem": "Where should you place a micro-shelter inside a 60 m alley microhabitat?",
          "options": [
            {
              "text": "Raised stairwell alcove shielded from wind",
              "rationale_wrong": null
            },
            {
              "text": "Next to a busy cafe doorway",
              "rationale_wrong": "Doorways create complaints and foot traffic hazards."
            },
            {
              "text": "Under a leaking gutter",
              "rationale_wrong": "Flood zones keep bedding damp and unsafe."
            },
            {
              "text": "Along a dog patrol path",
              "rationale_wrong": "Predator corridors stress the colony."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Apply",
          "difficulty": "Medium",
          "misconceptions": [
            "doorway_is_best"
          ],
          "correct_rationale": "Shelters should be elevated, dry, wind-sheltered, and have two exits."
        },
        {
          "stem": "Where should traps be staged to reduce trap shyness when running TNR?",
          "options": [
            {
              "text": "In a discreet, pre-baited location away from feeding bowls",
              "rationale_wrong": null
            },
            {
              "text": "Directly beside the feeder's bowls",
              "rationale_wrong": "Combining feeding and trapping locations conditions avoidance."
            },
            {
              "text": "In the cafe doorway for easy access",
              "rationale_wrong": "Doorways increase conflict with businesses."
            },
            {
              "text": "Inside the micro-shelter",
              "rationale_wrong": "Trapping inside shelters breaks trust and removes safe refuge."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Analyze",
          "difficulty": "Medium",
          "misconceptions": [
            "trap_where_feed"
          ],
          "correct_rationale": "Separate, pre-baited trap sites keep meal routines predictable while preparing cats for capture."
        },
        {
          "stem": "When should trapping intensity increase to blunt seasonal kitten surges?",
          "options": [
            {
              "text": "Four to six weeks before expected spring or late-summer litters",
              "rationale_wrong": null
            },
            {
              "text": "Only during winter when colonies shrink",
              "rationale_wrong": "Winter trapping alone misses peak breeding seasons."
            },
            {
              "text": "Immediately after spotting the first new litter",
              "rationale_wrong": "Waiting for litters loses the preventative window."
            },
            {
              "text": "Whenever feeders complain about noise",
              "rationale_wrong": "Complaints do not necessarily align with reproductive cycles."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Analyze",
          "difficulty": "Medium",
          "misconceptions": [
            "react_after_litters"
          ],
          "correct_rationale": "Scheduling trapping ahead of predictable surges keeps populations stable."
        }
      ],
      "misconceptions": [
        {
          "id": "MC1",
          "misbelief": "Feeding alone keeps street kittens safe and stable.",
          "why_plausible": "Feeding is visible, easy to organize, and shows immediate response from cats.",
          "correction": "Survival also depends on shelter, vaccination/parasite control, and TNR; feeding without these can raise disease and conflict risks."
        },
        {
          "id": "MC2",
          "misbelief": "TNR makes colonies grow because cats are returned.",
          "why_plausible": "Returned, ear-tipped cats remain visible in the area.",
          "correction": "Sterilized, site-faithful adults prevent new litters and defend territory, which stabilizes or reduces numbers over time."
        },
        {
          "id": "MC3",
          "misbelief": "Any milk is fine for neonate kittens.",
          "why_plausible": "Cow's milk is common and inexpensive.",
          "correction": "Use kitten milk replacer; cow's milk causes GI upset and malnutrition."
        },
        {
          "id": "MC4",
          "misbelief": "Cold, hungry kittens should be fed immediately.",
          "why_plausible": "Hunger seems most urgent to bystanders.",
          "correction": "Warm first, then feed; hypothermic kittens cannot digest safely and risk aspiration."
        }
      ],
      "confusables": [
        {
          "a": "Stray",
          "b": "Feral",
          "contrast": "Strays tolerate human proximity; ferals avoid it and show minimal socialization."
        },
        {
          "a": "Feeding Station",
          "b": "Trap Site",
          "contrast": "Feeding stations are stable and visible; trap sites are pre-baited and discreet to reduce trap shyness."
        },
        {
          "a": "Shelter",
          "b": "Nest",
          "contrast": "Shelters are human-made and weatherproof; nests are queen-selected natural hideouts that are fragile and hidden."
        }
      ],
      "short_answers": [
        {
          "stem": "What term describes the 50–100 meter map you sketch for planning?",
          "canonical_answer": "microhabitat",
          "acceptable_answers": [
            "micro habitat"
          ],
          "wrong_answers": [
            {
              "answer": "territory",
              "explanation": "Territory is broader; planning uses a focused microhabitat map.",
              "misconception_ids": []
            },
            {
              "answer": "district",
              "explanation": "Districts are far larger than the actionable mapping zone.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "A microhabitat map captures food, shelter, risk, and human interfaces within 50–100 meters.",
          "learning_objectives_covered": [
            "lo_2"
          ],
          "cognitive_level": "Understand"
        },
        {
          "stem": "What phrase describes the spring and late-summer kitten boom?",
          "canonical_answer": "kitten season",
          "acceptable_answers": [
            "kitten seasons"
          ],
          "wrong_answers": [
            {
              "answer": "winter lull",
              "explanation": "Winter is typically a slower breeding period.",
              "misconception_ids": []
            },
            {
              "answer": "feeding cycle",
              "explanation": "Feeding cycles occur daily; the boom is seasonal kitten season.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Kitten season marks the predictable surge in births requiring proactive trapping and sheltering.",
          "learning_objectives_covered": [
            "lo_1"
          ],
          "cognitive_level": "Remember"
        },
        {
          "stem": "Which record keeps dates, locations, and ear-tip status during TNR?",
          "canonical_answer": "TNR log",
          "acceptable_answers": [
            "trap log",
            "tnr ledger"
          ],
          "wrong_answers": [
            {
              "answer": "feeding roster",
              "explanation": "Feeding rosters track volunteers, not trapping data.",
              "misconception_ids": []
            },
            {
              "answer": "adoption sheet",
              "explanation": "Adoption paperwork is separate from colony sterilization tracking.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Maintaining a TNR log preserves sterilization records and guides future campaigns.",
          "learning_objectives_covered": [
            "lo_5"
          ],
          "cognitive_level": "Apply"
        },
        {
          "stem": "Which cat profile must be returned to territory the same day after surgery?",
          "canonical_answer": "lactating queen",
          "acceptable_answers": [
            "nursing queen"
          ],
          "wrong_answers": [
            {
              "answer": "juvenile tom",
              "explanation": "Juvenile males can recover longer before release.",
              "misconception_ids": []
            },
            {
              "answer": "feral male",
              "explanation": "Adult males can typically recover for 24 hours before return.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Lactating queens must nurse within hours, so they require same-day return.",
          "learning_objectives_covered": [
            "lo_6"
          ],
          "cognitive_level": "Apply"
        },
        {
          "stem": "What mobile service partners with feeders to sterilize colonies?",
          "canonical_answer": "mobile clinic",
          "acceptable_answers": [
            "mobile veterinary clinic",
            "mobile vet"
          ],
          "wrong_answers": [
            {
              "answer": "pet store",
              "explanation": "Pet stores sell supplies but do not perform sterilizations.",
              "misconception_ids": []
            },
            {
              "answer": "dog park",
              "explanation": "Dog parks are community spaces, not surgical partners.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Municipal or NGO mobile clinics provide onsite sterilization and vaccination support.",
          "learning_objectives_covered": [
            "lo_1"
          ],
          "cognitive_level": "Understand"
        }
      ],
      "podcast_transcript": "Istanbul's street kittens live in a managed commons: survival and population stability come from residents, feeders, and municipal clinics working together. Classify cats first: strays accept human proximity; ferals avoid it. Note kitten life stages—neonate (0–2 w), infant (2–4 w), transitional (4–8 w), juvenile (8–24 w)—because feeding, sheltering, and TNR timing depend on age. Seasonality matters: expect kitten surges in spring and late summer; prepare for thermal stress in winter.\n\nMap a 50–100 m microhabitat. Mark on a sketch: 1) food sources (dumpsters, cafes, feeder spots), 2) shelters (nooks, basements, existing \"cat houses\"), 3) risks (traffic lanes, dogs, flood paths, conflicts), 4) human–cat interfaces (markets, tourist hubs, schools). Add actors: who feeds, who complains, nearest mobile clinic.\n\nRecommendations:\n- Place micro-shelters elevated, dry, wind-sheltered, with two exits; anchor and keep clean. Add insulation before winter; add shade and water in heat.\n- Keep feeding stations consistent and tidy away from doorways; separate them from discreet pre-baited trap sites.\n- Schedule intensified trapping 4–6 weeks before spring/late-summer surges; prioritize juveniles at surgical weight and visibly intact adults; same-day return for lactating queens.\n\nThis map plus rationale guides shelter placement and trap cycles while respecting site fidelity and social license."
    },
    {
      "id": "c0a8dc23-f59e-48f0-b8e4-86dae4b0b758",
      "title": "From Triage to TNR: Integrated Care and Control Plan",
      "learner_level": "intermediate",
      "source_material": null,
      "objectives": [
        {
          "id": "lo_3",
          "title": "Sequence Kitten Triage",
          "description": "Sequence kitten triage in warmth–hydration–respiration–nutrition order and classify cases into urgent, priority, or routine pathways.",
          "bloom_level": null
        },
        {
          "id": "lo_4",
          "title": "Plan Age-Based Care",
          "description": "Specify age-appropriate feeding, micro-shelter features, and a basic vaccination and parasite-control schedule for a given kitten profile.",
          "bloom_level": null
        },
        {
          "id": "lo_5",
          "title": "Design Seasonal TNR",
          "description": "Design a Trap–Neuter–Return (TNR) workflow aligned to seasonality, including ear-tipping, return-to-territory, and simple record-keeping.",
          "bloom_level": null
        },
        {
          "id": "lo_6",
          "title": "Handle Critical Edge Cases",
          "description": "Identify edge cases such as lactating queens, late pregnancy, panleukopenia outbreaks, or seasonal extremes and specify the required operational adjustments.",
          "bloom_level": null
        }
      ],
      "mcqs": [
        {
          "stem": "Triage a 3-week-old kitten: cold, lethargic, shallow breathing. What is the priority action?",
          "options": [
            {
              "text": "Warm gently, then reassess breathing before feeding",
              "rationale_wrong": null
            },
            {
              "text": "Offer wet food to raise energy",
              "rationale_wrong": "Feeding before warming risks aspiration and shock."
            },
            {
              "text": "Begin deworming immediately",
              "rationale_wrong": "Deworming waits until the kitten is stable."
            },
            {
              "text": "Transport for surgery",
              "rationale_wrong": "Surgery is not appropriate until the kitten is stabilized."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Apply",
          "difficulty": "Medium",
          "misconceptions": [
            "feed_cold_kittens"
          ],
          "correct_rationale": "Warmth comes first in the triage sequence, followed by hydration and respiration checks."
        },
        {
          "stem": "Which triage category fits a kitten that is bright-eyed, hydrated, and eating well?",
          "options": [
            {
              "text": "Routine",
              "rationale_wrong": null
            },
            {
              "text": "Urgent",
              "rationale_wrong": "Urgent is reserved for unstable kittens needing immediate care."
            },
            {
              "text": "Critical",
              "rationale_wrong": "Critical applies when vital functions are failing."
            },
            {
              "text": "Quarantine",
              "rationale_wrong": "Quarantine is used for infectious disease management."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Understand",
          "difficulty": "Easy",
          "misconceptions": [
            "all_strays_urgent"
          ],
          "correct_rationale": "Stable kittens enter the routine pathway for ongoing monitoring and care."
        },
        {
          "stem": "At what age do core vaccines typically begin for juvenile kittens?",
          "options": [
            {
              "text": "Around eight to nine weeks",
              "rationale_wrong": null
            },
            {
              "text": "At two weeks",
              "rationale_wrong": "Two-week-old kittens are too young and still reliant on maternal antibodies."
            },
            {
              "text": "After six months",
              "rationale_wrong": "Waiting six months leaves kittens unprotected during high-risk months."
            },
            {
              "text": "Only after adoption",
              "rationale_wrong": "Vaccines should begin before adoption to ensure colony health."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Remember",
          "difficulty": "Medium",
          "misconceptions": [
            "delay_vaccines"
          ],
          "correct_rationale": "Vaccination protocols start around eight to nine weeks with boosters a few weeks later."
        },
        {
          "stem": "Which bedding keeps winter shelters warm and dry?",
          "options": [
            {
              "text": "Straw",
              "rationale_wrong": null
            },
            {
              "text": "Towels",
              "rationale_wrong": "Towels hold moisture and freeze when damp."
            },
            {
              "text": "Newspaper",
              "rationale_wrong": "Newspaper packs down and loses insulating air pockets."
            },
            {
              "text": "Wool blankets",
              "rationale_wrong": "Blankets absorb moisture and become heavy and cold."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Apply",
          "difficulty": "Easy",
          "misconceptions": [
            "fabric_is_warmer"
          ],
          "correct_rationale": "Straw sheds moisture and traps warm air, keeping shelters dry and insulated."
        },
        {
          "stem": "After TNR surgery, when should most cats be returned to their territory?",
          "options": [
            {
              "text": "Within 24–48 hours once stable",
              "rationale_wrong": null
            },
            {
              "text": "After one full week indoors",
              "rationale_wrong": "Extended indoor stays stress ferals and block territory re-entry."
            },
            {
              "text": "Immediately after anesthesia",
              "rationale_wrong": "Cats need observation until they regain mobility."
            },
            {
              "text": "Only when a new litter appears",
              "rationale_wrong": "Return is based on recovery, not colony reproduction events."
            }
          ],
          "correct_index": 0,
          "cognitive_level": "Analyze",
          "difficulty": "Medium",
          "misconceptions": [
            "weeklong_hold"
          ],
          "correct_rationale": "Returning within 24–48 hours balances healing with maintaining territory familiarity."
        }
      ],
      "misconceptions": [
        {
          "id": "MC1",
          "misbelief": "Feeding first is safest for weak kittens.",
          "why_plausible": "Hunger is visible and feels most urgent.",
          "correction": "Triage follows warmth → hydration → respiration → nutrition; warming precedes feeding to prevent aspiration and shock."
        },
        {
          "id": "MC2",
          "misbelief": "Any milk works for neonates.",
          "why_plausible": "Cow's milk is common and inexpensive.",
          "correction": "Use kitten milk replacer (KMR); cow's milk causes GI upset and malnutrition."
        },
        {
          "id": "MC3",
          "misbelief": "Vaccination is optional for outdoor colonies.",
          "why_plausible": "Street cats seem hardy and already exposed.",
          "correction": "Core vaccines reduce outbreaks; herd effect protects the whole colony."
        },
        {
          "id": "MC4",
          "misbelief": "Relocating cats is better than returning them.",
          "why_plausible": "New location seems safer or cleaner.",
          "correction": "TNR returns cats to their territory; site fidelity maintains stability and prevents the vacuum effect."
        }
      ],
      "confusables": [
        {
          "a": "Stray",
          "b": "Feral",
          "contrast": "Strays tolerate human proximity; ferals avoid it and show minimal socialization."
        },
        {
          "a": "TNR",
          "b": "Relocation",
          "contrast": "TNR sterilizes and returns to origin; relocation moves cats and risks disorientation and colony refill."
        },
        {
          "a": "Core vaccine",
          "b": "Parasite control",
          "contrast": "Vaccines prevent viral/bacterial disease; parasite control targets internal/external parasites like worms and fleas."
        }
      ],
      "short_answers": [
        {
          "stem": "List the triage sequence used for kittens in this unit.",
          "canonical_answer": "warmth hydration respiration nutrition",
          "acceptable_answers": [
            "warmth hydration respiration nutrition"
          ],
          "wrong_answers": [
            {
              "answer": "respiration hydration warmth nutrition",
              "explanation": "Warmth comes first before assessing breathing.",
              "misconception_ids": [
                "swap_triage_order"
              ]
            },
            {
              "answer": "hydration warmth nutrition respiration",
              "explanation": "Changing the order can risk aspiration and shock.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Kittens stabilize best when you restore warmth, then hydration, check breathing, and finally feed.",
          "learning_objectives_covered": [
            "lo_3"
          ],
          "cognitive_level": "Remember"
        },
        {
          "stem": "What formula replaces maternal milk for neonate feeding?",
          "canonical_answer": "kitten milk replacer",
          "acceptable_answers": [
            "kmr"
          ],
          "wrong_answers": [
            {
              "answer": "cow milk",
              "explanation": "Cow milk upsets digestion and lacks proper nutrients.",
              "misconception_ids": [
                "feed_cold_kittens"
              ]
            },
            {
              "answer": "water",
              "explanation": "Water alone cannot provide nutrition for neonates.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Kitten milk replacer supplies balanced nutrients for bottle-feeding neonates.",
          "learning_objectives_covered": [
            "lo_4"
          ],
          "cognitive_level": "Understand"
        },
        {
          "stem": "What age range marks the key socialization window for kittens?",
          "canonical_answer": "two to seven weeks",
          "acceptable_answers": [
            "2 to 7 weeks",
            "2-7 weeks"
          ],
          "wrong_answers": [
            {
              "answer": "ten to twelve weeks",
              "explanation": "Socialization gains drop sharply after seven weeks.",
              "misconception_ids": []
            },
            {
              "answer": "one to two weeks",
              "explanation": "Neonates lack senses needed for handling practice.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Gentle daily handling between two and seven weeks helps convert ferals to adoptable kittens.",
          "learning_objectives_covered": [
            "lo_6"
          ],
          "cognitive_level": "Understand"
        },
        {
          "stem": "What does an ear-tip on a community cat signal?",
          "canonical_answer": "sterilized",
          "acceptable_answers": [
            "spayed",
            "neutered"
          ],
          "wrong_answers": [
            {
              "answer": "owned",
              "explanation": "Ear-tips mark TNR completion, not private ownership.",
              "misconception_ids": []
            },
            {
              "answer": "vaccinated only",
              "explanation": "Ear-tips indicate sterilization with optional vaccines, not vaccines alone.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Ear-tips show the cat has been trapped, sterilized, and returned to its territory.",
          "learning_objectives_covered": [
            "lo_5"
          ],
          "cognitive_level": "Remember"
        },
        {
          "stem": "Which outbreak demands immediate isolation and deep cleaning?",
          "canonical_answer": "panleukopenia",
          "acceptable_answers": [
            "feline panleukopenia"
          ],
          "wrong_answers": [
            {
              "answer": "ringworm",
              "explanation": "Ringworm needs treatment but not the same emergency isolation response.",
              "misconception_ids": []
            },
            {
              "answer": "fleas",
              "explanation": "Fleas are managed with preventatives and do not require shutdown protocols.",
              "misconception_ids": []
            }
          ],
          "explanation_correct": "Panleukopenia spreads rapidly, so colonies must isolate cases and disinfect immediately.",
          "learning_objectives_covered": [
            "lo_6"
          ],
          "cognitive_level": "Analyze"
        }
      ],
      "podcast_transcript": "Start with triage. Sequence needs: warmth → hydration → respiration → nutrition. Urgent: cold, lethargic, or labored breathing; warm to safe temperature before any feeding. Priority: ocular/nasal discharge or low weight but stable breathing. Routine: active, eating, normal vitals.\n\nMatch care to age. Neonates (0–2 wks): KMR by bottle, tiny frequent feeds; keep dry, draft-free, and warmed. 2–4 wks: introduce gruel; 4–8 wks: transition to wet food; 8+ wks: high-protein wet/dry. Micro-shelter: elevated, insulated box with wind break, dual exits, shade and airflow in heat; straw (not fabric) for winter moisture.\n\nDisease prevention: begin core vaccines around weaning (e.g., 8–9 wks) with a booster in 3–4 weeks; deworm by weight; add flea control to cut vector risks and build herd effect.\n\nTNR workflow: pre-bait, trap, sterilize, ear-tip, vaccinate as possible, recover, return to the same spot within 24–48 hours. Plan campaigns late winter and late summer to blunt kitten surges; log photos, location, ear-tip status, sex, dates, and interventions.\n\nEdge-case adjustments: lactating queens—same-day return or delay surgery; late pregnancy—postpone when feasible; panleukopenia—isolate and pause mixing; heatwaves—shade and water stations; winter—elevate shelters, use straw."
    }
  ],
  "resources": [
    {
      "id": "5d9518b7-ebb5-49db-b8f4-1bce021ac753",
      "user_id": 2,
      "resource_type": "file_upload",
      "filename": "kitten-field-notes.txt",
      "extracted_text": "Feeding log — Karaköy colony\n05:30 warm goat-milk formula for neonates (24 ml split across four kittens).\n12:15 replaced damp straw in shelter crates; added thermal discs.\n18:40 observed Tomtom alley tomcat guarding trap line; adjust placement tomorrow.\n\nAction items: rotate heat packs every 6 hours, stock extra oral rehydration, photograph ear-tipped adults.",
      "extraction_metadata": {},
      "file_size": 364,
      "object_store_document_id": "6a7431f5-6f6e-48e7-9f9a-3569fbe5c923",
      "created_at": "2025-10-30 00:23:07.914800+00:00",
      "updated_at": "2025-10-30 00:23:07.914800+00:00",
      "document": {
        "id": "6a7431f5-6f6e-48e7-9f9a-3569fbe5c923",
        "user_id": 2,
        "s3_key": "seed/resources/epsilon/kitten-field-notes.txt",
        "s3_bucket": "lantern-room",
        "filename": "kitten-field-notes.txt",
        "content_type": "text/plain",
        "file_size": 364,
        "created_at": "2025-10-30 00:23:07.914800+00:00",
        "updated_at": "2025-10-30 00:23:07.914800+00:00"
      }
    },
    {
      "id": "1a53bd9d-d652-4f5d-9f10-2dad436e47f7",
      "user_id": 2,
      "resource_type": "url",
      "source_url": "https://istanbul.example.org/animal-welfare/community-feeding-guide",
      "extracted_text": "Excerpt: Istanbul Municipal Animal Welfare Directive (2023)\nHighlights feeding station spacing, volunteer registration, and sanitation requirements for urban colonies.\nKey reminder: keep food 3 meters from storefronts, and document veterinary visits in the shared ledger.",
      "extraction_metadata": {},
      "created_at": "2025-10-30 00:23:07.914800+00:00",
      "updated_at": "2025-10-30 00:23:07.914800+00:00"
    }
  ],
  "art_image": {
    "id": "1a7efaaf-e91d-429b-b032-1a9d08e45af4",
    "user_id": 2,
    "s3_key": "seed/7cf29b22-58e2-4b16-88af-db5162a151bf.png",
    "s3_bucket": "lantern-room",
    "filename": "unit-art-9435f1bf-472d-47c5-a759-99beadd98076.png",
    "content_type": "image/png",
    "file_size": 1991902,
    "width": 1024,
    "height": 1024,
    "alt_text": "Ear‑tipped street kitten on a crate in a petrol‑blue, rain‑slick Istanbul alley under a tight spotlight; thin gilt lines indicate care stations and an open humane trap.",
    "description": "Cinematic realism: petrol‑blue, rain‑slick Istanbul alley; ear‑tipped kitten, tiny gauze wrap, on a lacquered crate in a tight spotlight. Hairline gilt lines map care points and humane trap; Art‑Deco geometry, 3% grain.",
    "created_at": "2025-10-30 00:23:07.914800+00:00",
    "updated_at": "2025-10-30 00:23:07.914800+00:00"
  },
  "podcast_audio": {
    "id": "b2992f30-f404-43e9-a4fa-dc15c698e025",
    "user_id": 2,
    "s3_key": "seed/f2ff972d-b8d1-4549-afd4-0e791bee9882.mp3",
    "s3_bucket": "lantern-room",
    "filename": "unit-9435f1bf-472d-47c5-a759-99beadd98076.mp3",
    "content_type": "audio/mpeg",
    "file_size": 4668000,
    "duration_seconds": 233.0,
    "bitrate_kbps": 128,
    "sample_rate_hz": 44100,
    "transcript": "Picture Istanbul at dawn. The call to prayer, the hiss of kettles, and in the alley between a bakery and a barber—two wet-nosed kittens blinking into the day. They don't make it because of luck. They make it because a city of humans manages a commons, whether it knows it or not. That's our unit: from seeing the system to working the system.\n\nStart with classification. Strays tolerate us. Ferals don't. That single split decides how close we get, how we feed, how we trap. Then read the clock on a kitten's body. Neonate, zero to two weeks—eyes closed, heat-dependent. Infant, two to four—eyes open, wobble stance. Transitional, four to eight—teething, learning to eat. Juvenile, eight to twenty-four—fast, curious, hitting surgical weight. Seasonality is the drumbeat. Spring and late summer flood the streets with kittens. Winter tests endurance. If you know the rhythm, you can play ahead of it.\n\nNow shrink your world to a 50–100 meter circle. Walk it. Sketch it. Where's food? Dumpsters behind meyhanes, a feeder's mat of bowls under the fig tree, a cafe's crumbs at closing. Where's shelter? The dry corner under the stairs, a basement vent, an old \"cat house\" near the kiosk. Where's danger? A taxi cut-through, a dog pack's patrol, a gutter that becomes a river when it rains, the shop owner who's had enough. Where do cats meet people? Schools, markets, tourist choke points. Name the actors: the auntie who feeds at dusk, the municipal mobile clinic two streets over, the guy who complains when bowls block his door.\n\nThen place things with intention. Micro-shelters elevated, dry, out of the wind, with two exits. Insulate before the cold; shade and water before the heat. Keep feeding stations tidy and consistent, but not on thresholds. And keep trap sites separate and discreet, pre-baited so trap day isn't a surprise. Four to six weeks before the spring and late-summer waves, turn up the trapping. Prioritize juveniles at weight and intact adults. Lactating queens? Sterilize only if you can return same day to the exact spot.\n\nLesson two starts with a single rule: triage in order—warmth, hydration, respiration, nutrition. Cold and limp, or breathing hard? That's urgent. Warm first. Don't feed a cold kitten. Stable but snotty eyes, underweight? Priority. Bright-eyed, eating, normal vitals? Routine.\n\nFeed by stage. Neonates get kitten milk replacer by bottle, small and frequent, in warmth and dryness. Two to four weeks, gruel. Four to eight, move to wet food. Eight and up, high-protein wet and dry. Micro-shelters get straw in winter, not fabric. Airflow and shade in heat. Begin core vaccines around eight to nine weeks; boost three to four weeks later. Deworm by weight. Add flea control to cut vectors and protect the group.\n\nTNR is choreography. Pre-bait. Trap. Sterilize. Ear-tip. Vaccinate when possible. Recover. Return to the same territory within 24–48 hours. Time campaigns for late winter and late summer to blunt kitten surges. Track everything: photos, locations, ear-tip status, sex, dates, interventions. That ledger is your memory.\n\nEdge cases change the tempo. Lactating queens—same-day return. Late pregnancy—postpone if you can. Panleukopenia—stop mixing, isolate, bleach. Heatwave—shade and water stations. Winter—elevate shelters, add straw, cut drafts. And watch the socialization window: from roughly two to seven weeks, gentle daily handling can turn a life on the street into a home.\n\nSo here's your charge. Map one microhabitat. Place one shelter right. Set one clean feeding routine apart from your future trap line. Run one triage. Plan one season-timed TNR cycle, and write it down. Istanbul's street kittens aren't waiting for perfect. They're waiting for you to start. Next, pick a colony and commit twelve weeks. We'll be here, walking the alley with you.",
    "created_at": "2025-10-30 00:23:07.914800+00:00",
    "updated_at": "2025-10-30 00:23:07.914800+00:00"
  },
  "learning_conversations": {
    "coach": [
      {
        "id": "c5d2e8f1-a4b7-4c9f-8e2d-a1c3e5f7b9d1",
        "user_key": "eylem",
        "title": "Seasonality in kitten colonies",
        "status": "active",
        "metadata": {
          "topic": "Managed Commons in Practice"
        },
        "resource_ids": [],
        "messages": [
          {
            "role": "user",
            "content": "How dramatic is the seasonal variation in street kitten populations?",
            "offset_seconds": 0
          },
          {
            "role": "assistant",
            "content": "Very significant. Spring and late summer see exponential population growth as breeding season peaks. Winter reduces populations through mortality and reduced breeding. Understanding this rhythm lets you time TNR campaigns to maximum effect—trap before the waves to prevent the surge.",
            "offset_seconds": 8
          },
          {
            "role": "user",
            "content": "Should I focus resources differently by season?",
            "offset_seconds": 15
          },
          {
            "role": "assistant",
            "content": "Absolutely. Pre-spring (late winter) and pre-late-summer: maximize trapping of juveniles at weight and intact adults. Breeding season: emergency support, maternal care. Late fall/winter: shelter and warmth preparation, reduced trapping unless targeting problematic individuals.",
            "offset_seconds": 20
          }
        ]
      }
    ],
    "assistant": [
      {
        "id": "b1d4f6a9-c2e5-4b8a-9d3f-e7a2c4f6b8d0",
        "user_key": "eylem",
        "title": "Triage prioritization and kitten age assessment",
        "status": "active",
        "metadata": {},
        "messages": [
          {
            "role": "user",
            "content": "When you say triage in order of warmth, hydration, respiration, nutrition—how do you assess each quickly?",
            "offset_seconds": 0
          },
          {
            "role": "assistant",
            "content": "Warmth: Touch the belly—should be warm to the touch. If cold, the kitten is in shock. Hydration: Pinch the skin gently—it should snap back quickly. Slow snap = dehydration. Respiration: Watch the belly rise and fall. Should be 20-40 breaths/minute at rest. Nutrition: Only address after the first three are stable.",
            "offset_seconds": 6
          },
          {
            "role": "user",
            "content": "How do you quickly estimate a kitten's age in the field?",
            "offset_seconds": 15
          },
          {
            "role": "assistant",
            "content": "Eyes: Closed = newborn to 10 days. Opening = 2-3 weeks. Fully open = 3+ weeks. Teeth: No teeth = first 3 weeks. Incisors only = 3-5 weeks. Canines appearing = 5-7 weeks. All teeth = 8+ weeks. Size and coordination also matter, but eyes and teeth are your quick guides.",
            "offset_seconds": 20
          },
          {
            "role": "user",
            "content": "Once I triage, how long should I wait before feeding?",
            "offset_seconds": 25
          },
          {
            "role": "assistant",
            "content": "Never feed a cold kitten. Warm first, then hydrate (fluids), stabilize respiration, and only then feed. A cold kitten who eats risks aspiration. Wait 30-60 minutes after warming before introducing food.",
            "offset_seconds": 28
          }
        ]
      }
    ]
  }
}